Ran Plan for dir: `appCD` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.config-server_lg will be destroyed
  # (because aws_cloudwatch_log_group.config-server_lg is not in configuration)
- resource "aws_cloudwatch_log_group" "config-server_lg" {
      - arn               = "arn:aws:logs:us-east-1:180217099948:log-group:config-server_foo_dev" -> null
      - id                = "config-server_foo_dev" -> null
      - name              = "config-server_foo_dev" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_security_group.config-server_sg will be destroyed
  # (because aws_security_group.config-server_sg is not in configuration)
- resource "aws_security_group" "config-server_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:180217099948:security-group/sg-0660b179cf8c19cb3" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0660b179cf8c19cb3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8008
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0746590d24e413913",
                ]
              - self             = false
              - to_port          = 8008
            },
        ] -> null
      - name                   = "config-server-foo-dev-ecs-sg" -> null
      - owner_id               = "180217099948" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-004df3306da713951" -> null
    }

  # module.api-gateway_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "api-gateway-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-02dec3194c4e97d05",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "api-gateway-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "api-gateway"
                  + port     = 8011
                }
            }
        }
    }

  # module.api-gateway_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/api-gateway-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/api-gateway-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-gateway-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "api-gateway_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "api-gateway"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "api-gateway-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8011
                          - hostPort      = 8011
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "api-gateway-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.auth-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "auth-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "auth-service-foo-dev"
          + container_port   = 8012
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/auth-service-foo-dev-tg/f246d4700613cfa5"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-03db8255ffdcbca83",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "auth-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "auth-service"
                  + port     = 8012
                }
            }
        }
    }

  # module.auth-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/auth-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/auth-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-auth-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "auth-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "auth-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "auth-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8012
                          - hostPort      = 8012
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "auth-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.cart-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cart-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "cart-service-foo-dev"
          + container_port   = 8013
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/cart-service-foo-dev-tg/1ea70fe8836c003f"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-08ddd9f50dc830852",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "cart-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "cart-service"
                  + port     = 8013
                }
            }
        }
    }

  # module.cart-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/cart-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/cart-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-cart-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "cart-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "cart-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "cart-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8013
                          - hostPort      = 8013
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "cart-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.config-server_task_definition.aws_ecs_task_definition.task will be destroyed
  # (because aws_ecs_task_definition.task is not in configuration)
- resource "aws_ecs_task_definition" "task" {
      - arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/config-server-foo-dev-ecs-task-def:1" -> null
      - arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/config-server-foo-dev-ecs-task-def" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-config-server:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "config-server_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "config-server"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "config-server-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8008
                          - hostPort      = 8008
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - execution_role_arn       = "arn:aws:iam::180217099948:role/foo-dev-execution-role" -> null
      - family                   = "config-server-foo-dev-ecs-task-def" -> null
      - id                       = "config-server-foo-dev-ecs-task-def" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 1 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # module.discovery-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "discovery-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-05d742be038929bd7",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "discovery-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "discovery-service"
                  + port     = 8010
                }
            }
        }
    }

  # module.discovery-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/discovery-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/discovery-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-service-discovery:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "discovery-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "discovery-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "discovery-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8010
                          - hostPort      = 8010
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "discovery-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.orchestration-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "orchestration-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "orchestration-service-foo-dev"
          + container_port   = 8014
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/orchestration-service-foo-dev-tg/5d474e3ca9485b68"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-04e501bc85419f44f",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "orchestration-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "orchestration-service"
                  + port     = 8014
                }
            }
        }
    }

  # module.orchestration-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/orchestration-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/orchestration-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-orchestration-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "orchestration-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "orchestration-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "orchestration-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8014
                          - hostPort      = 8014
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "orchestration-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.order-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "order-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "order-service-foo-dev"
          + container_port   = 8015
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/order-service-foo-dev-tg/77be181ff085a072"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-002982a1ee2f13966",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "order-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "order-service"
                  + port     = 8015
                }
            }
        }
    }

  # module.order-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/order-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/order-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-order-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "order-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "order-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "order-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8015
                          - hostPort      = 8015
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "order-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.private_nat_gw_route.aws_route.route will be updated in-place
~ resource "aws_route" "route" {
      + gateway_id             = "nat-0cad5f88caf9f14f5"
        id                     = "r-rtb-094f68557076b84781080289494"
      - nat_gateway_id         = "nat-0cad5f88caf9f14f5" -> null
        # (4 unchanged attributes hidden)
    }

  # module.product-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "product-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "product-service-foo-dev"
          + container_port   = 8016
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/product-service-foo-dev-tg/633577afc2baa6c4"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ef9f29a3480bf45d",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "product-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "product-service"
                  + port     = 8016
                }
            }
        }
    }

  # module.product-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/product-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/product-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-product-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "product-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "product-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "product-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8016
                          - hostPort      = 8016
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "product-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.rds.aws_security_group.rds-sg will be created
+ resource "aws_security_group" "rds-sg" {
      + arn                    = (known after apply)
      + description            = "allow internal database traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "TLS from VPC"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-sg"
        }
      + tags_all               = {
          + "Name" = "rds-sg"
        }
      + vpc_id                 = "vpc-004df3306da713951"
    }

  # module.user-service_ecs_service.aws_ecs_service.service will be created
+ resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:180217099948:cluster/foo-dev-ecs-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "user-service-foo-dev-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "user-service-foo-dev"
          + container_port   = 8017
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:180217099948:targetgroup/user-service-foo-dev-tg/48434c9731ae5d7c"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0f1b16407b315ec19",
            ]
          + subnets          = [
              + "subnet-028e49e16daed05e8",
              + "subnet-0326f6a66d8a8bda5",
              + "subnet-04181ba0529bdd184",
              + "subnet-0955518b986647260",
              + "subnet-097d6fb0a9042ec8b",
              + "subnet-0eb3c7ee1a636661b",
            ]
        }

      + service_connect_configuration {
          + enabled   = true
          + namespace = "foo-dev"

          + service {
              + discovery_name = "user-service-foo-dev"
              + port_name      = "local"

              + client_alias {
                  + dns_name = "user-service"
                  + port     = 8017
                }
            }
        }
    }

  # module.user-service_task_definition.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:180217099948:task-definition/user-service-foo-dev-ecs-task-def:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:180217099948:task-definition/user-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 10
                  - environment      = []
                  - essential        = true
                  - image            = "appcd2023/is-user-service:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "true"
                          - awslogs-group         = "user-service_foo_dev"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "user-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "user-service-foo-dev"
                  - portMappings     = [
                      - {
                          - containerPort = 8017
                          - hostPort      = 8017
                          - name          = "local"
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "user-service-foo-dev-ecs-task-def" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.rds.module.db.module.db_instance.aws_db_instance.this[0] will be created
+ resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "audit",
          + "general",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "mysql-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.small"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:00:00-sun:03:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {
          + create = "40m"
          + delete = "40m"
          + update = "80m"
        }
    }

  # module.rds.module.db.module.db_instance.random_id.snapshot_identifier[0] will be created
+ resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "mysql-db"
        }
    }

  # module.rds.module.db.module.db_option_group.aws_db_option_group.this[0] will be created
+ resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "5.7"
      + name                     = (known after apply)
      + name_prefix              = "mysql-db-"
      + option_group_description = "mysql-db option group"
      + tags                     = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }

      + option {
          + db_security_group_memberships  = []
          + option_name                    = "MARIADB_AUDIT_PLUGIN"
          + vpc_security_group_memberships = []

          + option_settings {
              + name  = "SERVER_AUDIT_EVENTS"
              + value = "CONNECT"
            }
          + option_settings {
              + name  = "SERVER_AUDIT_FILE_ROTATIONS"
              + value = "37"
            }
        }

      + timeouts {
          + delete = "15m"
        }
    }

  # module.rds.module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
+ resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "mysql-db parameter group"
      + family      = "mysql5.7"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "mysql-db-"
      + tags        = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8"
        }
    }

  # module.rds.module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
+ resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "mysql-db subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "mysql-db-"
      + subnet_ids              = [
          + "subnet-028e49e16daed05e8",
          + "subnet-0326f6a66d8a8bda5",
          + "subnet-04181ba0529bdd184",
          + "subnet-0955518b986647260",
          + "subnet-097d6fb0a9042ec8b",
          + "subnet-0eb3c7ee1a636661b",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Name"        = "mysql-db"
          + "Project"     = "foo"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 22 to add, 1 to change, 11 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d appCD`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-dev.dev.appcd.io/lock?id=cafi-dev%252FE-Commerce-Microservice-Platform%252FappCD%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d appCD`
</details>
Plan: 22 to add, 1 to change, 11 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`